starry-m/RT1021_OV2640_simple_camera/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_LCD_DC_GPIO                                                  GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_LCD_DC_GPIO_PIN                                                 4U   /*!< GPIO pin number */
#define BOARD_LCD_DC_GPIO_PIN_MASK                                    (1U << 4U)   /*!< GPIO pin mask */
#define BOARD_LCD_DC_PORT                                                  GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_LCD_DC_PIN                                                      4U   /*!< PORT pin number */
#define BOARD_LCD_DC_PIN_MASK                                         (1U << 4U)   /*!< PORT pin mask */

/* GPIO_EMC_37 (number 119), SEMC_D13/U14[50] */
/* Routed pin properties */
#define BOARD_SEMC_D13_PERIPHERAL                                         LPSPI4   /*!< Peripheral name */
#define BOARD_SEMC_D13_SIGNAL                                               PCS2   /*!< Signal name */

/* GPIO_EMC_31 (number 125), SEMC_DM1/U14[39] */
/* Routed pin properties */
#define BOARD_LCD_BLK_PERIPHERAL                                           GPIO2   /*!< Peripheral name */
#define BOARD_LCD_BLK_SIGNAL                                             gpio_io   /*!< Signal name */
#define BOARD_LCD_BLK_CHANNEL                                                31U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_LCD_BLK_GPIO                                                 GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_LCD_BLK_GPIO_PIN                                               31U   /*!< GPIO pin number */
#define BOARD_LCD_BLK_GPIO_PIN_MASK                                  (1U << 31U)   /*!< GPIO pin mask */
#define BOARD_LCD_BLK_PORT                                                 GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_LCD_BLK_PIN                                                    31U   /*!< PORT pin number */
#define BOARD_LCD_BLK_PIN_MASK                                       (1U << 31U)   /*!< PORT pin mask */

/* GPIO_EMC_39 (number 117), SEMC_D15/U14[53] */
/* Routed pin properties */
#define BOARD_LCD_RES_PERIPHERAL                                           GPIO3   /*!< Peripheral name */
#define BOARD_LCD_RES_SIGNAL                                             gpio_io   /*!< Signal name */
#define BOARD_LCD_RES_CHANNEL                                                 7U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_LCD_RES_GPIO                                                 GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_LCD_RES_GPIO_PIN                                                7U   /*!< GPIO pin number */
#define BOARD_LCD_RES_GPIO_PIN_MASK                                   (1U << 7U)   /*!< GPIO pin mask */
#define BOARD_LCD_RES_PORT                                                 GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_LCD_RES_PIN                                                     7U   /*!< PORT pin number */
#define BOARD_LCD_RES_PIN_MASK                                        (1U << 7U)   /*!< PORT pin mask */

/* GPIO_EMC_10 (number 7), SEMC_CAS/U14[17] */
/* Routed pin properties */
#define BOARD_SEMC_CAS_PERIPHERAL                                         LPSPI2   /*!< Peripheral name */
#define BOARD_SEMC_CAS_SIGNAL                                                SCK   /*!< Signal name */

/* GPIO_EMC_11 (number 4), SEMC_RAS/U14[18] */
/* Routed pin properties */
#define BOARD_SEMC_RAS_PERIPHERAL                                         LPSPI2   /*!< Peripheral name */
#define BOARD_SEMC_RAS_SIGNAL                                               PCS0   /*!< Signal name */

/* GPIO_EMC_12 (number 3), SEMC_CS0/U14[19] */
/* Routed pin properties */
#define BOARD_SEMC_CS0_PERIPHERAL                                         LPSPI2   /*!< Peripheral name */
#define BOARD_SEMC_CS0_SIGNAL                                                SDO   /*!< Signal name */

/* GPIO_EMC_13 (number 2), SEMC_BA0/U14[20] */
/* Routed pin properties */
#define BOARD_SEMC_BA0_PERIPHERAL                                         LPSPI2   /*!< Peripheral name */
#define BOARD_SEMC_BA0_SIGNAL                                                SDI   /*!< Signal name */

/* GPIO_EMC_14 (number 1), SEMC_BA1/U14[21] */
/* Routed pin properties */
#define BOARD_SEMC_BA1_PERIPHERAL                                         LPSPI2   /*!< Peripheral name */
#define BOARD_SEMC_BA1_SIGNAL                                               PCS1   /*!< Signal name */

/* GPIO_EMC_02 (number 16), SEMC_D2/U14[5] */
/* Routed pin properties */
#define BOARD_SEMC_D2_PERIPHERAL                                          LPI2C1   /*!< Peripheral name */
#define BOARD_SEMC_D2_SIGNAL                                                 SCL   /*!< Signal name */

/* GPIO_EMC_03 (number 15), SEMC_D3/U14[7] */
/* Routed pin properties */
#define BOARD_SEMC_D3_PERIPHERAL                                          LPI2C1   /*!< Peripheral name */
#define BOARD_SEMC_D3_SIGNAL                                                 SDA   /*!< Signal name */

/* GPIO_AD_B0_10 (number 98), ENET_RXD0/U11[16]/J19[6] */
/* Routed pin properties */
#define BOARD_LED1_PERIPHERAL                                               PWM2   /*!< Peripheral name */
#define BOARD_LED1_SIGNAL                                                      A   /*!< Signal name */
#define BOARD_LED1_CHANNEL                                                    2U   /*!< Signal channel */

/* GPIO_AD_B0_14 (number 94), ENET_TXD0/U11[24]/J17[7] */
/* Routed pin properties */
#define BOARD_LED2_PERIPHERAL                                               PWM2   /*!< Peripheral name */
#define BOARD_LED2_SIGNAL                                                      A   /*!< Signal name */
#define BOARD_LED2_CHANNEL                                                    0U   /*!< Signal channel */

/* GPIO_AD_B0_15 (number 93), ENET_TXD1/U11[25]/J19[2] */
/* Routed pin properties */
#define BOARD_LED3_PERIPHERAL                                               PWM2   /*!< Peripheral name */
#define BOARD_LED3_SIGNAL                                                      B   /*!< Signal name */
#define BOARD_LED3_CHANNEL                                                    0U   /*!< Signal channel */

/* GPIO_EMC_07 (number 10), SEMC_D7/U14[13] */
/* Routed pin properties */
#define BOARD_SEMC_D7_PERIPHERAL                                            ENC1   /*!< Peripheral name */
#define BOARD_SEMC_D7_SIGNAL                                               PHASE   /*!< Signal name */
#define BOARD_SEMC_D7_CHANNEL                                                  A   /*!< Signal channel */

/* GPIO_EMC_09 (number 8), SEMC_WE/U14[16] */
/* Routed pin properties */
#define BOARD_SEMC_WE_PERIPHERAL                                            ENC1   /*!< Peripheral name */
#define BOARD_SEMC_WE_SIGNAL                                               PHASE   /*!< Signal name */
#define BOARD_SEMC_WE_CHANNEL                                                  B   /*!< Signal channel */

/* GPIO_EMC_05 (number 13), SEMC_D5/U14[10] */
/* Routed pin properties */
#define BOARD_ENC_Buttion_PERIPHERAL                                       GPIO2   /*!< Peripheral name */
#define BOARD_ENC_Buttion_SIGNAL                                         gpio_io   /*!< Signal name */
#define BOARD_ENC_Buttion_CHANNEL                                             5U   /*!< Signal channel */

