starry-m/RT1021_OV2640_simple_camera/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_ENC_Buttion_GPIO                                             GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_ENC_Buttion_GPIO_PIN                                            5U   /*!< GPIO pin number */
#define BOARD_ENC_Buttion_GPIO_PIN_MASK                               (1U << 5U)   /*!< GPIO pin mask */
#define BOARD_ENC_Buttion_PORT                                             GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_ENC_Buttion_PIN                                                 5U   /*!< PORT pin number */
#define BOARD_ENC_Buttion_PIN_MASK                                    (1U << 5U)   /*!< PORT pin mask */

/* GPIO_AD_B0_12 (number 96), ENET_RXER/U11[20]/J19[4] */
/* Routed pin properties */
#define BOARD_ENET_RXER_PERIPHERAL                                          ADC1   /*!< Peripheral name */
#define BOARD_ENET_RXER_SIGNAL                                                IN   /*!< Signal name */
#define BOARD_ENET_RXER_CHANNEL                                               0U   /*!< Signal channel */

/* GPIO_AD_B0_08 (number 100), ENET_TX_CLK/U11[9] */
/* Routed pin properties */
#define BOARD_ENET_TX_CLK_PERIPHERAL                                      LPI2C3   /*!< Peripheral name */
#define BOARD_ENET_TX_CLK_SIGNAL                                             SCL   /*!< Signal name */

/* GPIO_AD_B0_09 (number 99), ENET_RXD1/U11[15]/J17[3] */
/* Routed pin properties */
#define BOARD_ENET_RXD1_PERIPHERAL                                        LPI2C3   /*!< Peripheral name */
#define BOARD_ENET_RXD1_SIGNAL                                               SDA   /*!< Signal name */

/* GPIO_AD_B1_13 (number 76), CAN_STBY/J18[4] */
/* Routed pin properties */
#define BOARD_CAN_STBY_PERIPHERAL                                        FLEXIO1   /*!< Peripheral name */
#define BOARD_CAN_STBY_SIGNAL                                                 IO   /*!< Signal name */
#define BOARD_CAN_STBY_CHANNEL                                                2U   /*!< Signal channel */

/* GPIO_AD_B1_06 (number 84), ENET_INT/U11[21]/J17[8] */
/* Routed pin properties */
#define BOARD_ENET_INT_PERIPHERAL                                        FLEXIO1   /*!< Peripheral name */
#define BOARD_ENET_INT_SIGNAL                                                 IO   /*!< Signal name */
#define BOARD_ENET_INT_CHANNEL                                                9U   /*!< Signal channel */

/* GPIO_AD_B1_02 (number 90), SAI1_TX_SYNC/J19[10] */
/* Routed pin properties */
#define BOARD_CAM_PWDN_PERIPHERAL                                          GPIO1   /*!< Peripheral name */
#define BOARD_CAM_PWDN_SIGNAL                                            gpio_io   /*!< Signal name */
#define BOARD_CAM_PWDN_CHANNEL                                               18U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_CAM_PWDN_GPIO                                                GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_CAM_PWDN_GPIO_PIN                                              18U   /*!< GPIO pin number */
#define BOARD_CAM_PWDN_GPIO_PIN_MASK                                 (1U << 18U)   /*!< GPIO pin mask */
#define BOARD_CAM_PWDN_PORT                                                GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_CAM_PWDN_PIN                                                   18U   /*!< PORT pin number */
#define BOARD_CAM_PWDN_PIN_MASK                                      (1U << 18U)   /*!< PORT pin mask */

/* GPIO_AD_B1_03 (number 89), SAI1_TXD/J19[9] */
/* Routed pin properties */
#define BOARD_CAM_RES_PERIPHERAL                                           GPIO1   /*!< Peripheral name */
#define BOARD_CAM_RES_SIGNAL                                             gpio_io   /*!< Signal name */
#define BOARD_CAM_RES_CHANNEL                                                19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_CAM_RES_GPIO                                                 GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_CAM_RES_GPIO_PIN                                               19U   /*!< GPIO pin number */
#define BOARD_CAM_RES_GPIO_PIN_MASK                                  (1U << 19U)   /*!< GPIO pin mask */
#define BOARD_CAM_RES_PORT                                                 GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_CAM_RES_PIN                                                    19U   /*!< PORT pin number */
#define BOARD_CAM_RES_PIN_MASK                                       (1U << 19U)   /*!< PORT pin mask */

/* GPIO_AD_B1_04 (number 88), AUD_INT */
/* Routed pin properties */
#define BOARD_CAM_VS_PERIPHERAL                                            GPIO1   /*!< Peripheral name */
#define BOARD_CAM_VS_SIGNAL                                              gpio_io   /*!< Signal name */
#define BOARD_CAM_VS_CHANNEL                                                 20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_CAM_VS_GPIO                                                  GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_CAM_VS_GPIO_PIN                                                20U   /*!< GPIO pin number */
#define BOARD_CAM_VS_GPIO_PIN_MASK                                   (1U << 20U)   /*!< GPIO pin mask */
#define BOARD_CAM_VS_PORT                                                  GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_CAM_VS_PIN                                                     20U   /*!< PORT pin number */
#define BOARD_CAM_VS_PIN_MASK                                        (1U << 20U)   /*!< PORT pin mask */

/* GPIO_AD_B1_05 (number 87), SAI1_RXD */
/* Routed pin properties */
#define BOARD_CAM_HS_PERIPHERAL                                          FLEXIO1   /*!< Peripheral name */
#define BOARD_CAM_HS_SIGNAL                                                   IO   /*!< Signal name */
#define BOARD_CAM_HS_CHANNEL                                                 10U   /*!< Signal channel */

/* GPIO_AD_B1_07 (number 83), SD0_VSELECT/J19[1] */
/* Routed pin properties */
#define BOARD_CAM_XCLK_PERIPHERAL                                           PWM1   /*!< Peripheral name */
#define BOARD_CAM_XCLK_SIGNAL                                                  B   /*!< Signal name */
#define BOARD_CAM_XCLK_CHANNEL                                                0U   /*!< Signal channel */

/* GPIO_SD_B0_01 (number 47), SD1_D3/J15[2] */
/* Routed pin properties */
#define BOARD_SD1_D3_PERIPHERAL                                           USDHC1   /*!< Peripheral name */
#define BOARD_SD1_D3_SIGNAL                                           usdhc_data   /*!< Signal name */
#define BOARD_SD1_D3_CHANNEL                                                  3U   /*!< Signal channel */

/* GPIO_SD_B0_00 (number 48), SD1_D2/J15[1] */
/* Routed pin properties */
#define BOARD_SD1_D2_PERIPHERAL                                           USDHC1   /*!< Peripheral name */
#define BOARD_SD1_D2_SIGNAL                                           usdhc_data   /*!< Signal name */
#define BOARD_SD1_D2_CHANNEL                                                  2U   /*!< Signal channel */

/* GPIO_SD_B0_04 (number 43), SD1_D0/J15[7] */
/* Routed pin properties */
#define BOARD_SD1_D0_PERIPHERAL                                           USDHC1   /*!< Peripheral name */
#define BOARD_SD1_D0_SIGNAL                                           usdhc_data   /*!< Signal name */
#define BOARD_SD1_D0_CHANNEL                                                  0U   /*!< Signal channel */

/* GPIO_SD_B0_02 (number 46), SD1_CMD/J15[3] */
/* Routed pin properties */
#define BOARD_SD1_CMD_PERIPHERAL                                          USDHC1   /*!< Peripheral name */
#define BOARD_SD1_CMD_SIGNAL                                           usdhc_cmd   /*!< Signal name */

/* GPIO_SD_B0_03 (number 45), SD1_CLK/J15[5] */
/* Routed pin properties */
#define BOARD_SD1_CLK_PERIPHERAL                                          USDHC1   /*!< Peripheral name */
#define BOARD_SD1_CLK_SIGNAL                                           usdhc_clk   /*!< Signal name */

/* GPIO_SD_B0_05 (number 42), SD1_D1/J15[8] */
/* Routed pin properties */
#define BOARD_SD1_D1_PERIPHERAL                                           USDHC1   /*!< Peripheral name */
#define BOARD_SD1_D1_SIGNAL                                           usdhc_data   /*!< Signal name */
#define BOARD_SD1_D1_CHANNEL                                                  1U   /*!< Signal channel */

/* GPIO_SD_B0_06 (number 41), SD_CD_SW/J15[9] */
/* Routed pin properties */
#define BOARD_SD_CD_SW_PERIPHERAL                                         USDHC1   /*!< Peripheral name */
#define BOARD_SD_CD_SW_SIGNAL                                         usdhc_cd_b   /*!< Signal name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
